{"object_name_to_idx": {"__image__": 0, "window": 1, "tree": 2, "man": 3, "shirt": 4, "wall": 5, "person": 6, "building": 7, "ground": 8, "sign": 9, "light": 10, "sky": 11, "head": 12, "leaf": 13, "leg": 14, "hand": 15, "pole": 16, "grass": 17, "hair": 18, "car": 19, "woman": 20, "cloud": 21, "ear": 22, "eye": 23, "line": 24, "table": 25, "shoe": 26, "people": 27, "door": 28, "shadow": 29, "wheel": 30, "letter": 31, "pant": 32, "flower": 33, "water": 34, "chair": 35, "fence": 36, "floor": 37, "handle": 38, "nose": 39, "arm": 40, "plate": 41, "stripe": 42, "rock": 43, "jacket": 44, "hat": 45, "tail": 46, "foot": 47, "face": 48, "road": 49, "tile": 50, "number": 51, "sidewalk": 52, "short": 53, "spot": 54, "bag": 55, "snow": 56, "bush": 57, "boy": 58, "helmet": 59, "street": 60, "field": 61, "bottle": 62, "glass": 63, "tire": 64, "logo": 65, "background": 66, "roof": 67, "post": 68, "branch": 69, "boat": 70, "plant": 71, "umbrella": 72, "brick": 73, "picture": 74, "girl": 75, "button": 76, "mouth": 77, "track": 78, "part": 79, "bird": 80, "food": 81, "box": 82, "banana": 83, "dirt": 84, "cap": 85, "jean": 86, "glasses": 87, "bench": 88, "mirror": 89, "book": 90, "pillow": 91, "top": 92, "wave": 93, "shelf": 94, "clock": 95, "glove": 96, "headlight": 97, "bowl": 98, "trunk": 99, "bus": 100, "neck": 101, "edge": 102, "train": 103, "reflection": 104, "horse": 105, "paper": 106, "writing": 107, "kite": 108, "flag": 109, "seat": 110, "house": 111, "wing": 112, "board": 113, "lamp": 114, "cup": 115, "elephant": 116, "cabinet": 117, "coat": 118, "mountain": 119, "giraffe": 120, "sock": 121, "cow": 122, "counter": 123, "hill": 124, "word": 125, "finger": 126, "dog": 127, "wire": 128, "sheep": 129, "zebra": 130, "ski": 131, "ball": 132, "frame": 133, "back": 134, "bike": 135, "truck": 136, "animal": 137, "design": 138, "ceiling": 139, "sunglass": 140, "sand": 141, "skateboard": 142, "motorcycle": 143, "curtain": 144, "container": 145, "windshield": 146, "cat": 147, "beach": 148, "towel": 149, "knob": 150, "boot": 151, "bed": 152, "sink": 153, "paw": 154, "surfboard": 155, "horn": 156, "pizza": 157, "wood": 158, "bear": 159, "stone": 160, "orange": 161, "engine": 162, "photo": 163, "hole": 164, "child": 165, "railing": 166, "player": 167, "stand": 168, "ocean": 169, "lady": 170, "vehicle": 171, "sticker": 172, "pot": 173, "apple": 174, "basket": 175, "plane": 176, "key": 177, "tie": 178}, "object_idx_to_name": ["__image__", "window", "tree", "man", "shirt", "wall", "person", "building", "ground", "sign", "light", "sky", "head", "leaf", "leg", "hand", "pole", "grass", "hair", "car", "woman", "cloud", "ear", "eye", "line", "table", "shoe", "people", "door", "shadow", "wheel", "letter", "pant", "flower", "water", "chair", "fence", "floor", "handle", "nose", "arm", "plate", "stripe", "rock", "jacket", "hat", "tail", "foot", "face", "road", "tile", "number", "sidewalk", "short", "spot", "bag", "snow", "bush", "boy", "helmet", "street", "field", "bottle", "glass", "tire", "logo", "background", "roof", "post", "branch", "boat", "plant", "umbrella", "brick", "picture", "girl", "button", "mouth", "track", "part", "bird", "food", "box", "banana", "dirt", "cap", "jean", "glasses", "bench", "mirror", "book", "pillow", "top", "wave", "shelf", "clock", "glove", "headlight", "bowl", "trunk", "bus", "neck", "edge", "train", "reflection", "horse", "paper", "writing", "kite", "flag", "seat", "house", "wing", "board", "lamp", "cup", "elephant", "cabinet", "coat", "mountain", "giraffe", "sock", "cow", "counter", "hill", "word", "finger", "dog", "wire", "sheep", "zebra", "ski", "ball", "frame", "back", "bike", "truck", "animal", "design", "ceiling", "sunglass", "sand", "skateboard", "motorcycle", "curtain", "container", "windshield", "cat", "beach", "towel", "knob", "boot", "bed", "sink", "paw", "surfboard", "horn", "pizza", "wood", "bear", "stone", "orange", "engine", "photo", "hole", "child", "railing", "player", "stand", "ocean", "lady", "vehicle", "sticker", "pot", "apple", "basket", "plane", "key", "tie"], "attribute_name_to_idx": {"white": 0, "black": 1, "green": 2, "blue": 3, "red": 4, "brown": 5, "yellow": 6, "small": 7, "large": 8, "wooden": 9, "gray": 10, "silver": 11, "metal": 12, "orange": 13, "grey": 14, "tall": 15, "long": 16, "dark": 17, "pink": 18, "standing": 19, "clear": 20, "white ": 21, "round": 22, "tan": 23, "here": 24, "wood": 25, "glass": 26, "open": 27, "purple": 28, "big": 29, "short": 30, "plastic": 31, "parked": 32, "sitting": 33, "walking": 34, "black ": 35, "striped": 36, "young": 37, "brick": 38, "gold": 39, "empty": 40, "hanging": 41, "old": 42, "on": 43, "blue ": 44, "bright": 45, "concrete": 46, "cloudy": 47, "green ": 48, "colorful": 49, "one": 50, "beige": 51, "bare": 52, "wet": 53, "closed": 54, "square": 55, "light": 56, "stone": 57, "little": 58, "blonde": 59, "shiny": 60, "red ": 61, "dirty": 62, "thin": 63, "smiling": 64, "painted": 65, "flying": 66, "brown ": 67, "thick": 68, "sliced": 69, "playing": 70, "calm": 71, "looking": 72, "distant": 73, "tennis": 74, "part": 75, "leather": 76, "dry": 77, "rectangular": 78, "grassy": 79}, "attribute_idx_to_name": ["white", "black", "green", "blue", "red", "brown", "yellow", "small", "large", "wooden", "gray", "silver", "metal", "orange", "grey", "tall", "long", "dark", "pink", "standing", "clear", "white ", "round", "tan", "here", "wood", "glass", "open", "purple", "big", "short", "plastic", "parked", "sitting", "walking", "black ", "striped", "young", "brick", "gold", "empty", "hanging", "old", "on", "blue ", "bright", "concrete", "cloudy", "green ", "colorful", "one", "beige", "bare", "wet", "closed", "square", "light", "stone", "little", "blonde", "shiny", "red ", "dirty", "thin", "smiling", "painted", "flying", "brown ", "thick", "sliced", "playing", "calm", "looking", "distant", "tennis", "part", "leather", "dry", "rectangular", "grassy"], "pred_name_to_idx": {"__in_image__": 0, "on": 1, "next to": 2, "has": 3, "parked on": 4, "by": 5, "with": 6, "along": 7, "against": 8, "in": 9, "under": 10, "of": 11, "wearing": 12, "sitting in": 13, "wears": 14, "beside": 15, "walking on": 16, "at": 17, "on top of": 18, "behind": 19, "made of": 20, "have": 21, "near": 22, "sitting on": 23, "hanging on": 24, "in front of": 25, "carrying": 26, "above": 27, "over": 28, "and": 29, "on side of": 30, "riding": 31, "inside": 32, "attached to": 33, "around": 34, "holding": 35, "standing on": 36, "laying on": 37, "for": 38, "below": 39, "standing in": 40, "covering": 41, "covered in": 42, "belonging to": 43, "eating": 44, "looking at": 45}, "pred_idx_to_name": ["__in_image__", "on", "next to", "has", "parked on", "by", "with", "along", "against", "in", "under", "of", "wearing", "sitting in", "wears", "beside", "walking on", "at", "on top of", "behind", "made of", "have", "near", "sitting on", "hanging on", "in front of", "carrying", "above", "over", "and", "on side of", "riding", "inside", "attached to", "around", "holding", "standing on", "laying on", "for", "below", "standing in", "covering", "covered in", "belonging to", "eating", "looking at"]}